[
  {
    "id": "mtg-001",
    "opportunityId": "opp-001",
    "accountId": "acc-001",
    "date": "2025-01-10",
    "title": "Initial Discovery - Nordea Visitor Management",
    "participants": ["Alex Berg", "Johan Lindqvist (Nordea)", "Maria Ek (Nordea)"],
    "transcriptRaw": "Alex: Thanks for joining today. Can you walk me through your current visitor management process?\n\nJohan: Sure. Right now we use a paper-based sign-in at reception. Visitors fill out a form, get a badge, and that's it. There's no digital trail.\n\nMaria: The biggest issue is compliance. We're a bank — we need to know exactly who was on-site at any given time, and right now we can't produce that report reliably.\n\nAlex: How many visitors do you handle per day across your locations?\n\nJohan: Around 200 across our four main offices. The Helsinki HQ alone sees about 80.\n\nMaria: We've looked at Lenel and Honeywell, but they feel very hardware-heavy. We want something cloud-native that integrates with our existing access control.\n\nJohan: Onboarding is a concern too. Our receptionists aren't technical. If the system is complicated, adoption will fail.\n\nAlex: Understood. What about pre-registration? Do hosts currently notify reception in advance?\n\nMaria: Sometimes, but it's ad hoc — usually an email or a phone call. There's no standardized process.\n\nJohan: We'd love self-service pre-registration where the host sends an invite and the visitor gets a QR code.\n\nAlex: That's definitely something we support. Let me schedule a demo focused on your compliance and pre-registration needs.",
    "insights": {
      "summary": "Nordea uses paper-based visitor sign-in across 4 offices (~200 visitors/day). Main drivers are compliance reporting and digitization. They want cloud-native, easy onboarding, and self-service pre-registration. Evaluated Lenel and Honeywell but found them too hardware-heavy.",
      "painPoints": [
        { "text": "No digital audit trail for visitor compliance", "snippet": "we need to know exactly who was on-site at any given time, and right now we can't produce that report reliably" },
        { "text": "Paper-based sign-in process", "snippet": "Right now we use a paper-based sign-in at reception" },
        { "text": "No standardized pre-registration process", "snippet": "it's ad hoc — usually an email or a phone call" }
      ],
      "featureRequests": [
        { "text": "Self-service pre-registration with QR codes", "snippet": "the host sends an invite and the visitor gets a QR code" },
        { "text": "Integration with existing access control", "snippet": "something cloud-native that integrates with our existing access control" }
      ],
      "objections": [
        { "text": "Concern about onboarding complexity for non-technical staff", "snippet": "Our receptionists aren't technical. If the system is complicated, adoption will fail" }
      ],
      "competitors": [
        { "name": "Lenel", "context": "Evaluated but found too hardware-heavy", "snippet": "We've looked at Lenel and Honeywell, but they feel very hardware-heavy" },
        { "name": "Honeywell", "context": "Evaluated but found too hardware-heavy", "snippet": "We've looked at Lenel and Honeywell, but they feel very hardware-heavy" }
      ],
      "actionItems": [
        { "text": "Schedule compliance-focused demo for Nordea", "owner": "Alex Berg", "done": false },
        { "text": "Prepare pre-registration workflow walkthrough", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-002",
    "opportunityId": "opp-001",
    "accountId": "acc-001",
    "date": "2025-01-24",
    "title": "Demo Follow-up - Nordea Visitor Management",
    "participants": ["Alex Berg", "Johan Lindqvist (Nordea)", "Maria Ek (Nordea)", "Erik Dahl (Nordea IT)"],
    "transcriptRaw": "Alex: Great to have Erik from IT joining us today. How did the demo go from your perspective?\n\nErik: The pre-registration flow was impressive. My concern is around data residency. We need all visitor data stored within the EU, preferably in the Nordics.\n\nMaria: The compliance dashboard was exactly what we need. Can it generate reports for the Finnish FSA on demand?\n\nAlex: Yes, we have configurable compliance report templates. We can tailor them to FSA requirements.\n\nJohan: Pricing came up internally. The per-location license model feels expensive when we're looking at 12 locations eventually.\n\nErik: Also, what's your SSO integration story? We use Azure AD exclusively.\n\nAlex: We support Azure AD, Okta, and Google Workspace for SSO. It's a standard SAML/OIDC integration.\n\nJohan: Timeline is important. We have a board review in March and would like to have a pilot running by then.\n\nAlex: That's tight but doable if we start the pilot configuration next week.",
    "insights": {
      "summary": "Post-demo follow-up with IT stakeholder. Compliance dashboard well received. Key concerns: EU/Nordic data residency, per-location pricing at scale (12 locations), and Azure AD SSO integration. Target: pilot by March board review.",
      "painPoints": [
        { "text": "Data residency requirements (EU/Nordics)", "snippet": "We need all visitor data stored within the EU, preferably in the Nordics" },
        { "text": "Per-location pricing concern at scale", "snippet": "The per-location license model feels expensive when we're looking at 12 locations" }
      ],
      "featureRequests": [
        { "text": "Configurable compliance reports for Finnish FSA", "snippet": "Can it generate reports for the Finnish FSA on demand?" },
        { "text": "Azure AD SSO integration", "snippet": "what's your SSO integration story? We use Azure AD exclusively" }
      ],
      "objections": [
        { "text": "Per-location pricing too expensive at scale", "snippet": "The per-location license model feels expensive when we're looking at 12 locations eventually" },
        { "text": "Tight timeline for pilot (March board review)", "snippet": "We have a board review in March and would like to have a pilot running by then" }
      ],
      "competitors": [],
      "actionItems": [
        { "text": "Send data residency documentation to Erik", "owner": "Alex Berg", "done": false },
        { "text": "Prepare volume pricing proposal for 12 locations", "owner": "Alex Berg", "done": false },
        { "text": "Schedule pilot kickoff for next week", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-003",
    "opportunityId": "opp-003",
    "accountId": "acc-002",
    "date": "2025-01-15",
    "title": "Discovery Call - Volvo Factory Access",
    "participants": ["Alex Berg", "Anders Nilsson (Volvo)", "Karin Johansson (Volvo Security)"],
    "transcriptRaw": "Alex: Tell me about the current access process for visitors and contractors at your factories.\n\nAnders: It's a mess, honestly. Contractors need to check in at the gate, show ID, get a temporary badge. But there's no system linking their visit to the work order.\n\nKarin: Safety is our number one priority. We had an incident last year where an unauthorized contractor entered a restricted zone. That accelerated this project.\n\nAlex: How many contractor visits do you handle per week?\n\nAnders: Across our three Swedish plants, roughly 500 per week. Torslanda alone is about 250.\n\nKarin: We need integration with our safety training system. Contractors should not get access until they've completed the required safety modules.\n\nAnders: We've been talking to Genetec and HID's competitor Brivo. Genetec is strong on the video side but weak on visitor management.\n\nAlex: Our PIAM platform handles contractor pre-registration, safety training verification, and zone-based access control. Let me show you how that works.\n\nKarin: The onboarding process for new contractors is painful. It takes days to get them badged. We need same-day provisioning.\n\nAnders: And everything needs to work offline at the gate. Internet connectivity at the plants is spotty.",
    "insights": {
      "summary": "Volvo needs contractor access management across 3 Swedish plants (~500 visits/week). Triggered by unauthorized access incident. Key needs: link visits to work orders, safety training verification before access, same-day contractor provisioning, offline capability at gates.",
      "painPoints": [
        { "text": "No link between visitor/contractor check-in and work orders", "snippet": "there's no system linking their visit to the work order" },
        { "text": "Unauthorized access incident in restricted zone", "snippet": "We had an incident last year where an unauthorized contractor entered a restricted zone" },
        { "text": "Slow contractor onboarding (days to badge)", "snippet": "The onboarding process for new contractors is painful. It takes days to get them badged" },
        { "text": "Unreliable internet at factory gates", "snippet": "everything needs to work offline at the gate. Internet connectivity at the plants is spotty" }
      ],
      "featureRequests": [
        { "text": "Integration with safety training system", "snippet": "Contractors should not get access until they've completed the required safety modules" },
        { "text": "Same-day contractor provisioning", "snippet": "We need same-day provisioning" },
        { "text": "Offline capability at gates", "snippet": "everything needs to work offline at the gate" }
      ],
      "objections": [],
      "competitors": [
        { "name": "Genetec", "context": "In evaluation - strong on video but weak on visitor management", "snippet": "Genetec is strong on the video side but weak on visitor management" },
        { "name": "Brivo", "context": "Also in evaluation alongside Genetec", "snippet": "We've been talking to Genetec and HID's competitor Brivo" }
      ],
      "actionItems": [
        { "text": "Demo contractor pre-registration and safety training flow", "owner": "Alex Berg", "done": false },
        { "text": "Document offline gate capability", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-004",
    "opportunityId": "opp-004",
    "accountId": "acc-003",
    "date": "2025-01-08",
    "title": "Requirements Workshop - Siemens Campus Security",
    "participants": ["Alex Berg", "Thomas Weber (Siemens)", "Anna Schmidt (Siemens Facilities)"],
    "transcriptRaw": "Alex: What's driving the security upgrade initiative?\n\nThomas: We're consolidating three campuses into one mega-campus in Munich. 15,000 employees, plus up to 2,000 visitors daily. The current patchwork of systems won't scale.\n\nAnna: We have five different visitor management tools across the campuses. Some are paper, some are outdated digital systems from 2015. Nothing talks to each other.\n\nThomas: Compliance with ISO 27001 is mandatory. We need a full audit trail of every person on campus.\n\nAlex: That's a significant scale. How do you handle VIP visitors today?\n\nAnna: Poorly. VIPs still wait in line like everyone else. We need a fast-track lane with pre-approved access.\n\nThomas: We're also evaluating Honeywell's Pro-Watch and Lenel OnGuard. But we've heard their cloud offerings are immature.\n\nAnna: The onboarding complexity worries me. Training 50 reception staff across shifts is not trivial.\n\nThomas: Budget isn't the primary concern — reliability and compliance are. But we do need a phased rollout plan.\n\nAlex: Absolutely. We typically recommend starting with one building, proving the workflow, then expanding. Let me put together a phased proposal.",
    "insights": {
      "summary": "Siemens consolidating 3 campuses into one mega-campus (15K employees, 2K visitors/day). Currently using 5 different visitor systems. Must meet ISO 27001 compliance. Need VIP fast-track, unified platform, phased rollout. Also evaluating Honeywell Pro-Watch and Lenel OnGuard.",
      "painPoints": [
        { "text": "Fragmented visitor systems (5 different tools)", "snippet": "We have five different visitor management tools across the campuses" },
        { "text": "No VIP fast-track process", "snippet": "VIPs still wait in line like everyone else" },
        { "text": "Complex onboarding for large reception staff", "snippet": "Training 50 reception staff across shifts is not trivial" }
      ],
      "featureRequests": [
        { "text": "VIP fast-track lane with pre-approved access", "snippet": "We need a fast-track lane with pre-approved access" },
        { "text": "Phased rollout support", "snippet": "we do need a phased rollout plan" },
        { "text": "ISO 27001 compliance audit trail", "snippet": "Compliance with ISO 27001 is mandatory. We need a full audit trail" }
      ],
      "objections": [
        { "text": "Concern about onboarding complexity for 50+ reception staff", "snippet": "Training 50 reception staff across shifts is not trivial" }
      ],
      "competitors": [
        { "name": "Honeywell", "context": "Evaluating Pro-Watch but heard cloud offerings are immature", "snippet": "We're also evaluating Honeywell's Pro-Watch and Lenel OnGuard. But we've heard their cloud offerings are immature" },
        { "name": "Lenel", "context": "Evaluating OnGuard but heard cloud offerings are immature", "snippet": "We're also evaluating Honeywell's Pro-Watch and Lenel OnGuard" }
      ],
      "actionItems": [
        { "text": "Create phased rollout proposal for Siemens mega-campus", "owner": "Alex Berg", "done": false },
        { "text": "Prepare ISO 27001 compliance documentation", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-005",
    "opportunityId": "opp-005",
    "accountId": "acc-003",
    "date": "2025-01-20",
    "title": "PKI Discovery - Siemens Device Certificates",
    "participants": ["Alex Berg", "Thomas Weber (Siemens)", "Klaus Mueller (Siemens IoT)"],
    "transcriptRaw": "Alex: Klaus, can you describe your current certificate management situation?\n\nKlaus: We have around 50,000 IoT devices across our factories that need certificates for mutual TLS. Right now we're managing them manually with OpenSSL scripts and spreadsheets.\n\nThomas: It's a security risk. Certificates expire without warning, and when they do, production lines stop.\n\nKlaus: We need automated lifecycle management — issuance, renewal, revocation. And it has to scale to 200,000 devices over the next two years.\n\nAlex: What's your current CA infrastructure?\n\nKlaus: We have a Microsoft CA internally, but it doesn't handle IoT scale well. We've looked at Venafi and DigiCert, but Venafi is extremely expensive and DigiCert's IoT offering is still new.\n\nThomas: Integration with our Azure IoT Hub is critical. Devices register there and need certificates provisioned automatically.\n\nKlaus: Also, we need support for short-lived certificates — some devices need hourly rotation for zero-trust compliance.\n\nAlex: Our PKI-as-a-Service handles all of that. Let me walk you through our Azure IoT Hub integration and the automated rotation policies.",
    "insights": {
      "summary": "Siemens manages 50K IoT devices needing mTLS certificates, scaling to 200K. Currently manual (OpenSSL + spreadsheets). Certificate expiry causes production outages. Need automated lifecycle management, Azure IoT Hub integration, and short-lived certificate rotation for zero-trust.",
      "painPoints": [
        { "text": "Manual certificate management with scripts and spreadsheets", "snippet": "managing them manually with OpenSSL scripts and spreadsheets" },
        { "text": "Certificate expiry causing production outages", "snippet": "Certificates expire without warning, and when they do, production lines stop" },
        { "text": "Internal Microsoft CA doesn't scale for IoT", "snippet": "We have a Microsoft CA internally, but it doesn't handle IoT scale well" }
      ],
      "featureRequests": [
        { "text": "Automated certificate lifecycle (issuance, renewal, revocation)", "snippet": "We need automated lifecycle management — issuance, renewal, revocation" },
        { "text": "Azure IoT Hub integration", "snippet": "Integration with our Azure IoT Hub is critical" },
        { "text": "Short-lived certificate rotation (hourly) for zero-trust", "snippet": "we need support for short-lived certificates — some devices need hourly rotation" }
      ],
      "objections": [],
      "competitors": [
        { "name": "Venafi", "context": "Evaluated but extremely expensive", "snippet": "We've looked at Venafi and DigiCert, but Venafi is extremely expensive" },
        { "name": "DigiCert", "context": "IoT offering considered still too new", "snippet": "DigiCert's IoT offering is still new" }
      ],
      "actionItems": [
        { "text": "Demo Azure IoT Hub integration", "owner": "Alex Berg", "done": false },
        { "text": "Provide pricing for 200K device scale", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-006",
    "opportunityId": "opp-006",
    "accountId": "acc-004",
    "date": "2025-01-12",
    "title": "Initial Meeting - NHS Visitor Management",
    "participants": ["Alex Berg", "Sarah Thompson (NHS Digital)", "James Patel (NHS Facilities)"],
    "transcriptRaw": "Alex: Thanks for making time. What's the current visitor process at NHS facilities?\n\nSarah: It varies enormously. Some hospitals use paper logs, others have basic kiosk systems from different vendors. There's no unified view.\n\nJames: Patient safety is the core driver. We need to know who's in the building — contractors, vendors, non-staff visitors — especially in sensitive wards.\n\nSarah: GDPR compliance is huge for us. Visitor data must be processed lawfully and deleted after the retention period. Our current paper logs don't support automatic deletion.\n\nAlex: How many sites are we talking about?\n\nJames: Initially five pilot hospitals, but the goal is to roll out across 50+ NHS trusts.\n\nSarah: We've seen demos from Brivo and Genetec. Brivo's cloud approach is appealing but they don't have NHS-specific compliance features.\n\nJames: The onboarding concern is real. Hospital reception staff turnover is high. The system must be dead simple.\n\nSarah: And we need DBS check verification for certain contractor types before they can get access to patient areas.\n\nAlex: We can handle DBS integration and GDPR-compliant data retention. Let me prepare a healthcare-specific demo.",
    "insights": {
      "summary": "NHS needs unified visitor management across hospitals. Currently fragmented (paper + various kiosk vendors). Drivers: patient safety, GDPR compliance, automated data deletion. Pilot: 5 hospitals, target 50+ trusts. Need DBS check integration and simple onboarding for high-turnover staff.",
      "painPoints": [
        { "text": "Fragmented visitor systems across hospitals", "snippet": "Some hospitals use paper logs, others have basic kiosk systems from different vendors. There's no unified view" },
        { "text": "Paper logs don't support GDPR automatic deletion", "snippet": "Our current paper logs don't support automatic deletion" },
        { "text": "High staff turnover makes onboarding difficult", "snippet": "Hospital reception staff turnover is high. The system must be dead simple" }
      ],
      "featureRequests": [
        { "text": "GDPR-compliant automatic data deletion", "snippet": "Visitor data must be processed lawfully and deleted after the retention period" },
        { "text": "DBS check verification for contractor access", "snippet": "we need DBS check verification for certain contractor types" },
        { "text": "Simple onboarding for non-technical staff", "snippet": "The system must be dead simple" }
      ],
      "objections": [
        { "text": "Concern about onboarding complexity for high-turnover staff", "snippet": "Hospital reception staff turnover is high" }
      ],
      "competitors": [
        { "name": "Brivo", "context": "Cloud approach appealing but lacks NHS compliance features", "snippet": "Brivo's cloud approach is appealing but they don't have NHS-specific compliance features" },
        { "name": "Genetec", "context": "Also demoed as an option", "snippet": "We've seen demos from Brivo and Genetec" }
      ],
      "actionItems": [
        { "text": "Prepare NHS healthcare-specific demo", "owner": "Alex Berg", "done": false },
        { "text": "Document DBS check integration capabilities", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-007",
    "opportunityId": "opp-007",
    "accountId": "acc-005",
    "date": "2025-01-18",
    "title": "Discovery - Airbus Supplier Access Platform",
    "participants": ["Alex Berg", "Pierre Dubois (Airbus)", "Isabelle Martin (Airbus Security)"],
    "transcriptRaw": "Alex: What's driving the supplier access platform initiative?\n\nPierre: We have 3,000+ suppliers visiting our sites regularly. Managing their access is a nightmare — different processes at each site, no visibility across locations.\n\nIsabelle: ITAR compliance is non-negotiable. Certain areas are restricted to specific nationalities, and we must enforce that at the gate.\n\nPierre: Our current process involves emailing a PDF form, printing it, and manually checking it at reception. It's embarrassing for a company our size.\n\nAlex: How do you handle multi-site suppliers who visit several Airbus locations?\n\nIsabelle: That's the worst part. They re-register at every site. There's no shared supplier profile.\n\nPierre: We need a single supplier identity that works across all our European sites — Toulouse, Hamburg, Getafe, Broughton.\n\nIsabelle: We've evaluated Lenel and Gallagher. Lenel is strong but their multi-site federation is weak. Gallagher is good for physical security but not for visitor workflows.\n\nPierre: The onboarding of our security teams is a concern. We have 200+ security officers across sites and they're not tech-savvy.\n\nAlex: Our platform supports federated multi-site profiles and ITAR zone enforcement. Let me put together a tailored proposal.",
    "insights": {
      "summary": "Airbus needs unified supplier access across 4+ European sites (3,000+ suppliers). Current process is manual PDF forms. ITAR compliance critical. Need single supplier identity across sites, nationality-based zone restrictions. Evaluated Lenel (weak multi-site) and Gallagher (weak visitor workflows).",
      "painPoints": [
        { "text": "Manual PDF-based visitor registration process", "snippet": "emailing a PDF form, printing it, and manually checking it at reception" },
        { "text": "No shared supplier profile across sites", "snippet": "They re-register at every site. There's no shared supplier profile" },
        { "text": "No cross-site visibility for supplier visits", "snippet": "different processes at each site, no visibility across locations" }
      ],
      "featureRequests": [
        { "text": "Federated multi-site supplier identity", "snippet": "a single supplier identity that works across all our European sites" },
        { "text": "ITAR compliance zone enforcement", "snippet": "Certain areas are restricted to specific nationalities, and we must enforce that at the gate" },
        { "text": "Simple interface for non-tech security staff", "snippet": "200+ security officers across sites and they're not tech-savvy" }
      ],
      "objections": [
        { "text": "Concern about onboarding 200+ non-tech security officers", "snippet": "We have 200+ security officers across sites and they're not tech-savvy" }
      ],
      "competitors": [
        { "name": "Lenel", "context": "Strong overall but weak multi-site federation", "snippet": "Lenel is strong but their multi-site federation is weak" },
        { "name": "Gallagher", "context": "Good for physical security but not visitor workflows", "snippet": "Gallagher is good for physical security but not for visitor workflows" }
      ],
      "actionItems": [
        { "text": "Prepare multi-site federation demo", "owner": "Alex Berg", "done": false },
        { "text": "Document ITAR zone enforcement capabilities", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-008",
    "opportunityId": "opp-008",
    "accountId": "acc-005",
    "date": "2025-01-25",
    "title": "PKI Requirements - Airbus Infrastructure",
    "participants": ["Alex Berg", "Pierre Dubois (Airbus)", "Laurent Garcia (Airbus IT Security)"],
    "transcriptRaw": "Alex: Laurent, what's your current PKI setup?\n\nLaurent: We run an internal Microsoft CA hierarchy, but it's reaching its limits. We have 100,000 certificates to manage — employee badges, device certs, code signing, and email encryption.\n\nPierre: The operational burden is huge. Laurent's team spends 40% of their time on certificate-related incidents.\n\nLaurent: Outages from expired certificates are our biggest problem. Last quarter we had three production incidents caused by forgotten certificate renewals.\n\nAlex: What specific capabilities are you looking for?\n\nLaurent: First, automated renewal with notifications well before expiry. Second, centralized visibility — one dashboard showing all certificates across the organization. Third, support for multiple CA backends because we can't rip and replace overnight.\n\nPierre: We've talked to Venafi and AppViewX. Venafi wants a seven-figure deal and the implementation timeline is 6+ months. AppViewX is more affordable but their support reputation is concerning.\n\nLaurent: We also need EASA compliance for our aviation systems certificates. That's a hard requirement.\n\nAlex: Our PKI-as-a-Service supports hybrid CA backends and we can get you to production in weeks, not months. Let me schedule a technical deep-dive.",
    "insights": {
      "summary": "Airbus manages 100K certificates (badges, devices, code signing, email). Internal Microsoft CA at limits. 40% of security team time on cert incidents. 3 production outages last quarter from expired certs. Need automated renewal, centralized dashboard, hybrid CA support, EASA compliance.",
      "painPoints": [
        { "text": "Certificate expiry causing production outages", "snippet": "Last quarter we had three production incidents caused by forgotten certificate renewals" },
        { "text": "Security team spending 40% time on certificate incidents", "snippet": "Laurent's team spends 40% of their time on certificate-related incidents" },
        { "text": "Internal Microsoft CA reaching its limits", "snippet": "We run an internal Microsoft CA hierarchy, but it's reaching its limits" }
      ],
      "featureRequests": [
        { "text": "Automated renewal with advance notifications", "snippet": "automated renewal with notifications well before expiry" },
        { "text": "Centralized certificate visibility dashboard", "snippet": "one dashboard showing all certificates across the organization" },
        { "text": "Hybrid multi-CA backend support", "snippet": "support for multiple CA backends because we can't rip and replace overnight" },
        { "text": "EASA compliance for aviation certificates", "snippet": "We also need EASA compliance for our aviation systems certificates" }
      ],
      "objections": [],
      "competitors": [
        { "name": "Venafi", "context": "Seven-figure pricing and 6+ month implementation timeline", "snippet": "Venafi wants a seven-figure deal and the implementation timeline is 6+ months" },
        { "name": "AppViewX", "context": "More affordable but support reputation is concerning", "snippet": "AppViewX is more affordable but their support reputation is concerning" }
      ],
      "actionItems": [
        { "text": "Schedule technical deep-dive with Laurent's team", "owner": "Alex Berg", "done": false },
        { "text": "Prepare EASA compliance documentation", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-009",
    "opportunityId": "opp-002",
    "accountId": "acc-001",
    "date": "2025-01-28",
    "title": "PKI Exploration - Nordea Digital Banking",
    "participants": ["Alex Berg", "Erik Dahl (Nordea IT)", "Lisa Andersson (Nordea Security)"],
    "transcriptRaw": "Alex: Erik, you mentioned Nordea is also looking at PKI solutions. Can you give me the context?\n\nErik: Yes, we're modernizing our digital banking platform and need client certificates for strong customer authentication.\n\nLisa: PSD2 compliance requires strong customer authentication. We're looking at certificate-based mutual TLS as one approach.\n\nErik: We currently issue certificates through a third-party CA, but it's expensive and the process is manual. Takes 48 hours to issue a single certificate.\n\nLisa: We need to get that down to seconds for real-time provisioning during customer onboarding.\n\nAlex: How many certificates are we talking about?\n\nErik: We have 2 million retail customers. Not all will use certificates, but we're planning for 500,000 initially.\n\nLisa: We've spoken with DigiCert and Entrust. DigiCert's pricing is aggressive, but their API documentation is poor. Entrust has better docs but lacks modern REST APIs.\n\nErik: Whatever we choose needs to integrate with our existing HSM infrastructure from Thales.\n\nAlex: Our PKI platform has native HSM integration including Thales Luna. Let me prepare a banking-specific demo.",
    "insights": {
      "summary": "Nordea needs PKI for digital banking strong customer authentication (PSD2 compliance). Currently 48-hour manual certificate issuance. Need real-time provisioning for 500K customers. Must integrate with existing Thales HSM infrastructure.",
      "painPoints": [
        { "text": "Manual certificate issuance takes 48 hours", "snippet": "Takes 48 hours to issue a single certificate" },
        { "text": "Expensive third-party CA", "snippet": "we currently issue certificates through a third-party CA, but it's expensive" }
      ],
      "featureRequests": [
        { "text": "Real-time certificate provisioning (seconds, not hours)", "snippet": "We need to get that down to seconds for real-time provisioning" },
        { "text": "Thales HSM integration", "snippet": "needs to integrate with our existing HSM infrastructure from Thales" },
        { "text": "PSD2-compliant strong customer authentication", "snippet": "PSD2 compliance requires strong customer authentication" }
      ],
      "objections": [],
      "competitors": [
        { "name": "DigiCert", "context": "Aggressive pricing but poor API documentation", "snippet": "DigiCert's pricing is aggressive, but their API documentation is poor" },
        { "name": "Entrust", "context": "Better docs but lacks modern REST APIs", "snippet": "Entrust has better docs but lacks modern REST APIs" }
      ],
      "actionItems": [
        { "text": "Prepare banking-specific PKI demo with Thales HSM integration", "owner": "Alex Berg", "done": false },
        { "text": "Send PSD2 compliance whitepaper", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-010",
    "opportunityId": "opp-004",
    "accountId": "acc-003",
    "date": "2025-02-01",
    "title": "Proposal Review - Siemens Campus Security",
    "participants": ["Alex Berg", "Thomas Weber (Siemens)", "Anna Schmidt (Siemens Facilities)", "Markus Braun (Siemens Procurement)"],
    "transcriptRaw": "Alex: We've put together the phased proposal as discussed. Shall I walk you through it?\n\nMarkus: Yes please. I want to understand the total cost of ownership over three years.\n\nAlex: Phase 1 covers the main reception and two high-security buildings. Phase 2 adds the remaining 8 buildings. Phase 3 is the contractor management module.\n\nThomas: The phasing makes sense. My concern is the gap between Phase 1 and Phase 2. Will visitors who registered in Phase 1 buildings need to re-register when Phase 2 goes live?\n\nAlex: No, visitor profiles carry over. The database is unified from day one.\n\nAnna: What about the kiosk hardware? We'd prefer to use our existing iPad fleet rather than buying proprietary devices.\n\nAlex: We support iPads, Android tablets, and our own kiosks. iPads work great.\n\nMarkus: Compared to Honeywell's quote, you're about 15% higher on the initial setup but lower on annual maintenance. We need to see the five-year TCO comparison.\n\nThomas: One more thing — we need the system to support German and English. Some of our reception staff only speak German.\n\nAlex: Full multi-language support is included. We currently support 12 languages including German.\n\nMarkus: Send me the five-year TCO breakdown and we'll make our recommendation to the board next week.",
    "insights": {
      "summary": "Proposal review with procurement. Phased approach well received. Key concerns: TCO comparison with Honeywell (15% higher setup, lower maintenance), iPad kiosk compatibility, multi-language support (German), visitor profile continuity across phases.",
      "painPoints": [
        { "text": "Need to justify TCO vs competitor quotes", "snippet": "Compared to Honeywell's quote, you're about 15% higher on the initial setup" }
      ],
      "featureRequests": [
        { "text": "iPad fleet compatibility (no proprietary hardware)", "snippet": "We'd prefer to use our existing iPad fleet rather than buying proprietary devices" },
        { "text": "Multi-language support including German", "snippet": "we need the system to support German and English" }
      ],
      "objections": [
        { "text": "15% higher initial setup cost vs Honeywell", "snippet": "Compared to Honeywell's quote, you're about 15% higher on the initial setup but lower on annual maintenance" }
      ],
      "competitors": [
        { "name": "Honeywell", "context": "Competing quote — 15% lower initial setup but higher annual maintenance", "snippet": "Compared to Honeywell's quote, you're about 15% higher on the initial setup but lower on annual maintenance" }
      ],
      "actionItems": [
        { "text": "Prepare 5-year TCO comparison vs Honeywell", "owner": "Alex Berg", "done": false },
        { "text": "Confirm iPad compatibility specs", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-011",
    "opportunityId": "opp-007",
    "accountId": "acc-005",
    "date": "2025-02-03",
    "title": "Technical Deep-Dive - Airbus Multi-Site Architecture",
    "participants": ["Alex Berg", "Isabelle Martin (Airbus Security)", "Marc Lefebvre (Airbus IT)"],
    "transcriptRaw": "Alex: Marc, let's dig into the technical requirements for multi-site federation.\n\nMarc: Our primary concern is data sovereignty. Each country has different regulations — French data stays in France, German data in Germany. But we need a unified view.\n\nIsabelle: The system needs to handle peak loads during aircraft delivery events. We can have 500 visitors in a single day at Toulouse during a delivery.\n\nMarc: Latency is critical at the gates. Badge validation must happen in under 2 seconds, even during peak.\n\nAlex: Our architecture uses regional pods with a global sync layer. Data stays in-country but profiles are federated.\n\nMarc: What about disaster recovery? If the Toulouse pod goes down, can Hamburg take over?\n\nAlex: Yes, we have active-passive failover between pods with a 15-minute RPO.\n\nIsabelle: We've also re-evaluated Genetec since our last call. Their new cloud offering is competitive, but they admitted multi-site federation is on their 2026 roadmap, not available today.\n\nMarc: Integration with our SAP system for contractor management is a must. Contractor work orders live in SAP.\n\nAlex: We have a certified SAP connector. Let me show you the integration architecture.",
    "insights": {
      "summary": "Technical deep-dive on multi-site architecture. Key requirements: data sovereignty (country-specific data residency), sub-2-second gate validation at peak (500 visitors/day during deliveries), DR failover between sites, SAP integration for contractor work orders. Genetec re-evaluated but multi-site is on 2026 roadmap.",
      "painPoints": [
        { "text": "Data sovereignty requirements across multiple countries", "snippet": "Each country has different regulations — French data stays in France, German data in Germany" },
        { "text": "Peak load handling for aircraft delivery events", "snippet": "We can have 500 visitors in a single day at Toulouse during a delivery" }
      ],
      "featureRequests": [
        { "text": "Sub-2-second badge validation at gates", "snippet": "Badge validation must happen in under 2 seconds, even during peak" },
        { "text": "Regional data pods with global federation", "snippet": "Data stays in-country but profiles are federated" },
        { "text": "SAP integration for contractor work orders", "snippet": "Contractor work orders live in SAP" },
        { "text": "Active-passive disaster recovery between sites", "snippet": "If the Toulouse pod goes down, can Hamburg take over?" }
      ],
      "objections": [],
      "competitors": [
        { "name": "Genetec", "context": "Re-evaluated; multi-site federation on 2026 roadmap, not available today", "snippet": "they admitted multi-site federation is on their 2026 roadmap, not available today" }
      ],
      "actionItems": [
        { "text": "Share SAP connector documentation", "owner": "Alex Berg", "done": false },
        { "text": "Provide DR architecture diagram", "owner": "Alex Berg", "done": false }
      ]
    }
  },
  {
    "id": "mtg-012",
    "opportunityId": "opp-003",
    "accountId": "acc-002",
    "date": "2025-02-05",
    "title": "Demo Follow-up - Volvo Contractor Access",
    "participants": ["Alex Berg", "Anders Nilsson (Volvo)", "Karin Johansson (Volvo Security)", "Sven Eriksson (Volvo IT)"],
    "transcriptRaw": "Alex: Great to have Sven joining from IT. How did the demo land?\n\nSven: The contractor flow was solid. My question is about API integration. We need to connect this with our in-house workforce management system.\n\nAnders: The safety training verification was the highlight. Our HSE team was very impressed.\n\nKarin: One concern — the offline mode demo felt limited. Our gates can lose connectivity for hours. We need full offline capability, not just cached data.\n\nAlex: Fair point. Our offline mode stores the full visitor database locally and syncs when connectivity returns. Let me show you the detailed offline architecture.\n\nSven: We also need webhook notifications when a contractor checks in or out, so our workforce system stays in sync.\n\nAnders: Pricing-wise, Brivo came back with a lower quote. But they can't do offline mode at all, which is a dealbreaker for us.\n\nKarin: What about the physical badge printing? We need to print contractor badges at the gate with photo, company, and authorized zones.\n\nAlex: We support badge printing with DYMO and Brother printers. The badge template is fully customizable.\n\nSven: Last thing — we need the admin portal to support Swedish. English-only won't work for our gate security staff.",
    "insights": {
      "summary": "Post-demo follow-up with IT. Safety training verification was the highlight. Key concerns: full offline capability (not just cached data), API/webhook integration with workforce management system, badge printing at gates, Swedish language support. Brivo quoted lower but can't do offline.",
      "painPoints": [
        { "text": "Gates lose connectivity for hours — need full offline mode", "snippet": "Our gates can lose connectivity for hours. We need full offline capability, not just cached data" }
      ],
      "featureRequests": [
        { "text": "API and webhook integration with workforce management", "snippet": "We need to connect this with our in-house workforce management system" },
        { "text": "Webhook notifications for contractor check-in/out", "snippet": "We also need webhook notifications when a contractor checks in or out" },
        { "text": "Physical badge printing at gates (photo, company, zones)", "snippet": "We need to print contractor badges at the gate with photo, company, and authorized zones" },
        { "text": "Swedish language support for admin portal", "snippet": "we need the admin portal to support Swedish. English-only won't work" }
      ],
      "objections": [
        { "text": "Offline mode needs to be full, not just cached data", "snippet": "We need full offline capability, not just cached data" }
      ],
      "competitors": [
        { "name": "Brivo", "context": "Lower quote but no offline mode — dealbreaker for Volvo", "snippet": "Brivo came back with a lower quote. But they can't do offline mode at all" }
      ],
      "actionItems": [
        { "text": "Share offline architecture documentation", "owner": "Alex Berg", "done": false },
        { "text": "Provide API/webhook integration specs", "owner": "Alex Berg", "done": false },
        { "text": "Confirm Swedish language availability", "owner": "Alex Berg", "done": false }
      ]
    }
  }
]
